ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0c1105_c1106/GPIOB_1.0.xml
    <register id="GPIOB_DOUTTGL31_0" width="32" offset="0x12B0" description="Data output toggle 31 to 0">
        <bitfield id="DIO0" description="This bit is used to toggle DIO0 output." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO1" description="This bit is used to toggle DIO1 output." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO2" description="This bit is used to toggle DIO2 output." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO3" description="This bit is used to toggle DIO3 output." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO4" description="This bit is used to toggle DIO4 output." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO5" description="This bit is used to toggle DIO5 output." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO6" description="This bit is used to toggle DIO6 output." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO7" description="This bit is used to toggle DIO7 output." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO8" description="This bit is used to toggle DIO8 output." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO9" description="This bit is used to toggle DIO9 output." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO10" description="This bit is used to toggle DIO10 output." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO11" description="This bit is used to toggle DIO11 output." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO12" description="This bit is used to toggle DIO12 output." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO13" description="This bit is used to toggle DIO13 output." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO14" description="This bit is used to toggle DIO14 output." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO15" description="This bit is used to toggle DIO15 output." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO16" description="This bit is used to toggle DIO16 output." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO17" description="This bit is used to toggle DIO17 output." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO18" description="This bit is used to toggle DIO18 output." begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO19" description="This bit is used to toggle DIO19 output." begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO20" description="This bit is used to toggle DIO20 output." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO21" description="This bit is used to toggle DIO21 output." begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO22" description="This bit is used to toggle DIO22 output." begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO23" description="This bit is used to toggle DIO23 output." begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO24" description="This bit is used to toggle DIO24 output." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO25" description="This bit is used to toggle DIO25 output." begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO26" description="This bit is used to toggle DIO26 output." begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO27" description="This bit is used to toggle DIO27 output." begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO28" description="This bit is used to toggle DIO28 output." begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO29" description="This bit is used to toggle DIO29 output." begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO30" description="This bit is used to toggle DIO30 output." begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO31" description="This bit is used to toggle DIO31 output." begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
    </register>
    <register id="GPIOB_DOE31_0" width="32" offset="0x12C0" description="Data output enable 31 to 0">
        <bitfield id="DIO0" description="Enables data output for DIO0." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO1" description="Enables data output for DIO1." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO2" description="Enables data output for DIO2." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO3" description="Enables data output for DIO3." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO4" description="Enables data output for DIO4." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO5" description="Enables data output for DIO5." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO6" description="Enables data output for DIO6." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO7" description="Enables data output for DIO7." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO8" description="Enables data output for DIO8." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO9" description="Enables data output for DIO9." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO10" description="Enables data output for DIO10." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO11" description="Enables data output for DIO11." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO12" description="Enables data output for DIO12." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO13" description="Enables data output for DIO13." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO14" description="Enables data output for DIO14." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO15" description="Enables data output for DIO15." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO16" description="Enables data output for DIO16." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO17" description="Enables data output for DIO17." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO18" description="Enables data output for DIO18." begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO19" description="Enables data output for DIO19." begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO20" description="Enables data output for DIO20." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO21" description="Enables data output for DIO21." begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO22" description="Enables data output for DIO22." begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO23" description="Enables data output for DIO23." begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO24" description="Enables data output for DIO24." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO25" description="Enables data output for DIO25." begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO26" description="Enables data output for DIO26." begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO27" description="Enables data output for DIO27." begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO28" description="Enables data output for DIO28." begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO29" description="Enables data output for DIO29." begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO30" description="Enables data output for DIO30." begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO31" description="Enables data output for DIO31." begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
    </register>
