ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0c1105_c1106/GPIOB_1.0.xml
    <register id="GPIOB_DIN3_0" width="32" offset="0x1300" description="Data input 3 to 0">
        <bitfield id="DIO0" description="This bit reads the data input value of DIO0." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO1" description="This bit reads the data input value of DIO1." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO2" description="This bit reads the data input value of DIO2." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO3" description="This bit reads the data input value of DIO3." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="GPIOB_DIN7_4" width="32" offset="0x1304" description="Data input 7 to 4">
        <bitfield id="DIO4" description="This bit reads the data input value of DIO4." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO5" description="This bit reads the data input value of DIO5." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO6" description="This bit reads the data input value of DIO6." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO7" description="This bit reads the data input value of DIO7." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="GPIOB_DIN11_8" width="32" offset="0x1308" description="Data input 11 to 8">
        <bitfield id="DIO8" description="This bit reads the data input value of DIO8." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO9" description="This bit reads the data input value of DIO9." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO10" description="This bit reads the data input value of DIO10." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO11" description="This bit reads the data input value of DIO11." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="GPIOB_DIN15_12" width="32" offset="0x130C" description="Data input 15 to 12">
        <bitfield id="DIO12" description="This bit reads the data input value of DIO12." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO13" description="This bit reads the data input value of DIO13." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO14" description="This bit reads the data input value of DIO14." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO15" description="This bit reads the data input value of DIO15." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="GPIOB_DIN19_16" width="32" offset="0x1310" description="Data input 19 to 16">
        <bitfield id="DIO16" description="This bit reads the data input value of DIO16." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO17" description="This bit reads the data input value of DIO17." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO18" description="This bit reads the data input value of DIO18." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO19" description="This bit reads the data input value of DIO19." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
